app/Controllers/Admin.php

    public function dashboard()
    {
        if (session()->logged_in == false) {
            return redirect()->to(site_url('admin/login'));
        } else {
            $data = [
                'title' => "Dashboard",
                'page' => "Dashboard",
                'controller' => "Categories",
                'categorytot' => count($this->categoriesModel->findAll()),
                'transaksitot' => count($this->transactionModel->findAll()),
                'producttot' => count($this->voucherModel->findAll())
---
SELECT *
FROM `categories`
SELECT *
FROM `transaction`
SELECT *
FROM `voucher`

    public function getAll()
    {
        $response = $data['data'] = array();
        $result = $this->transactionModel->select()->findAll();
---
SELECT *
FROM `transaction`