app/Controllers/Categories.php

	public function getAll()
	{
		$response = $data['data'] = array();

		$result = $this->categoriesModel->select()->findAll();
---
SELECT *
FROM `categories`

	public function add()
	{
		$response = array();
		$fields['id_category'] = $this->request->getPost('id_category');
		$fields['category'] = $this->request->getPost('category');
		$fields['desc'] = $this->request->getPost('desc');


		// optional fields
		$fields['option_user_id'] = $this->request->getPost('option_user_id') == 'on' ? '1' : '0';
		$fields['option_server'] = $this->request->getPost('option_server') == 'on' ? '1' : '0';
		$fields['option_username'] = $this->request->getPost('option_username') == 'on' ? '1' : '0';

		// image
		if ($this->request->getFile('picture')) {
			$picture = $this->request->getFile('picture');
			$newName = $picture->getRandomName();
			$picture->move('./uploads/', $newName);
			$fields['picture'] = $newName;
			if ($this->categoriesModel->insert($fields)) {
---
INSERT INTO `categories` (`category`, `desc`) VALUES ('testing', 'asdsa')

	public function remove()
	{
		$response = array();

		$id = $this->request->getPost('params');

		if (!$this->validation->check($id, 'required|numeric')) {
			throw new \CodeIgniter\Exceptions\PageNotFoundException();
		} else {
			$findRecord = $this->categoriesModel->where('id_category', $id)->first();
			$image = $findRecord->picture;
			$filepath = './uploads/' . $image;
			if (file_exists($filepath)) {
				unlink($filepath);
				if ($this->categoriesModel->where('id_category', $id)->delete()) {
---
DELETE FROM `categories`
WHERE `id_category` = '13'