app/Controllers/Client.php

SELECT *
FROM `categories`
SELECT *
FROM `voucher`
---
    public function index()
    {
        $data = [
            'title' => "Home",
            'categories' => $this->categoriesModel->findAll(),
            'voucher' => $this->voucherModel->findAll(),

SELECT *
FROM `voucher`
WHERE `category` = '39'
 LIMIT 1
---
    public function setSession()
    {
        if ($this->request->getPost('id')) {
            $id = $this->request->getPost('id');
            session()->set('game', $id);
            $response['success'] = false;
            $response['messages'] = "No Voucher Found";
            if (session()->game == $id) {
                $voucer = $this->voucherModel->where('category', session()->game)->first();

SELECT *
FROM `voucher`
WHERE `category` = '39'
---
    public function selection()
    {
        if (session()->game == NULL | session()->game == "") {
            return redirect()->to(base_url());
        } else {
            $voucer = $this->voucherModel->where('category', session()->game)->findAll();