app/Controllers/Client.php

SELECT *
FROM `categories`
SELECT *
FROM `voucher`
---
    public function purchase()
    {
        $data = [
            'title' => "Home",
            'categories' => $this->categoriesModel->findAll(),
            'voucher' => $this->voucherModel->findAll(),