app/Controllers/Payment.php

    public function index()
    {
        $query   = $this->db->query("SELECT * FROM admin where username = 'admin' LIMIT 1");
        $result = $query->getResult();
        $nomorAdmin = $result[0]->password;
        if ($this->request->getPost()) {
            $fields['id_transaction'] = random_int(1, 2000) . random_int(1, 2000) . random_int(1, 2000) . random_int(1, 2000);
            $fields["amount"] = $this->request->getPost("amount");
            $fields["server_id"] = $this->request->getPost("server_id");
            $fields['user_id'] = $this->request->getPost("user_id");
            $fields['username'] = $this->request->getPost("username");
            $fields['email'] = $this->request->getPost("email");
            $fields['category'] = $this->request->getPost("category");
            $fields['status'] = "pending";
            $this->transactionModel->insert($fields);
---
INSERT INTO `transaction` (`id_transaction`, `amount`, `server_id`, `user_id`, `username`, `email`, `category`, `status`) VALUES (980725, '200000', '123', '123', '', 'priskilatheresia99@gmail.com', '39', 'pending')

    public function cekStatus()
    {

        if ($this->request->getPost("id")) {
            $id = $this->request->getPost("id");
            $find = $this->transactionModel->where('id_transaction', $id)->first();
---
SELECT *
FROM `transaction`
WHERE `id_transaction` = '2147483647'
 LIMIT 1