app/Controllers/Voucher.php

	public function getAll()
	{
		$response = $data['data'] = array();

		$result = $this->voucherModel->select()->findAll();
---
SELECT *
FROM `voucher`